# 题目15：从20*20的网格的左上角通往右下角有多少条路？
# 按照每个数代表走到此处的走法，是它上方和左边的两个数之和这种特性
'''
1	1	1	1	1
1	2	3   4   5
1  	3  	6  	10  15
1  	4 	10 	20 	35
1  	5 	15 	35 	70
'''
# 想到用递归解决
'''def rr(x,y):
	if x==1 or y==1:
		return 1
	else:
		return rr(x-1,y)+rr(x,y-1)
发现时间复杂度太大，所以用其他方式解决'''

ll = [[0 for i in range(21)] for j in range(21)]  # 构建一个二维列表长度21,全部赋值0
for i in range(21):  # 把首行首列赋值为1
    ll[i][0] = 1
    ll[0][i] = 1
for i in range(1, 21):  # 类似递归方式赋值其他所有位置
    for j in range(1, 21):
        ll[i][j] = ll[i - 1][j] + ll[i][j - 1]
print (ll[20][20])  # 容易错在坐标，因为是20x20，所以坐标处不是19，19，而是20，20
